<?php

// for 문 : 특정 처리를 반복저긍로 구현하고자 할 때 사용함

// 0 ~ 5까지 숫자를 출력

// for($i = 1; $i > 6; $i++) {
//     echo "숫자 : ".$i."\n";
//     // 우리가 반복하고 싶은 처리
// }

// break : 반복문을 처리하고 있는데 브레이크 문을 만나면 정지가 된다. (루프 종료)


// for($i = 1; $i < 6; $i++) {
//     if($i === 4){
//         break;
//     }
//     echo "숫자 : ".$i."\n";
// }

// -------------------------------------------------------------
// continue 문 : 처리 중에 continue를 에 만나면 컨티뉴 이 후처리는 건너 뛰고 바로 다음 처리 진행


// for($i = 1; $i < 100; $i++) {
//     echo "숫자 : ".$i."\n";
//     if(($i % 2) === 0) {
//         continue;
//     }
// }

// 구구단 2단 출력
$a = 7;
for($i = 1; $i <= 9; $i++) {
    echo " ".$a." X ".$i." = ".($i*$a)."\n"; 
}

// ----------------------------
// 다중 루프문
// ----------------------------

// for($i = 1; $i < 3; $i++) {
//     echo "바깥 LOOP문 : ".$i. "\n";

//     for($z = 1; $z < 3; $z++) {
//         echo "안쪽 LOOP문 : ".$z."\n";
//     }

for($i = 2; $i <= 9; $i++) {
    echo "** ".$i."단 **\n";

    for($a = 1; $a <= 9; $a++) {
        echo "".$i." X ".$a." = ".($a*$i)."\n";
    }
}

// 아래처럼 별을 찍어주세요.
// 예시)
// *****
// *****
// *****
// *****
// *****

// for($i = ; $i <= 5; $i++) {
//     echo "*****\n";
// }

// for($i = 0; $i <= 6; $i++) {
//     for($a = 1; $a - $i; $a++) {
//         echo "*\n";
//     }
//     echo"/n";
// }


// $num = 5;
// for($i = 1; $i <= $num; $i++) {
//     for($z = $num - $i; $z > 0; $z--) {
//         echo " ";
//     }
//     for($k = 1; $k <= $i; $k++) {
//         echo "*";
//     }
//     echo "\n";
// }

$a = 6;
// 구구단 6단 = 시간 5분
// for($i = 1; $i <= 9; $i++) {
//     echo "".$a." X ".$i." = ".($i*$a)."\n";
// }

for($i = 2; $i <= 9; $i++) {
    echo "".$i."단입니다.\n";
        for($a = 1; $a <= 9; $a++) {
            echo "".$i." X ".$a." = ".($i*$a)."\n";
        }
}





